// 1.რიცხვების მასივის გათვალისწინებით, გამოიყენეთ ფილტრი ახალი მასივის შესაქმნელად,
//  რომელიც შეიცავს მხოლოდ ლუწი რიცხვებს.
// const numbersArray = [10, 20, 30, 40];

// const evenNumbersArray = numbersArray.filter((el) => el % 2 === 0);
// console.log(evenNumbersArray);
// =================================================================================================== \\

// 2.მომხმარებლების გაფილტვრა ასაკის მიხედვით: მომხმარებლის ობიექტების მასივის გათვალისწინებით,
//  თვისებების სახელით და ასაკის მიხედვით, გამოიყენეთ ფილტრი 18 წელზე უფროსი ასაკის მომხმარებელთა მასივის შესაქმნელად.
// const users = [
//   { id: 1, age: 8, firstName: "kesane" },
//   { id: 2, age: 14, firstName: "maya" },
//   { id: 3, age: 14, firstName: "tatu" },
//   { id: 4, age: 43, firstName: "me" },
// ];

// const adultUsers = (users) =>
//   users.filter((user) => {
//     return user.age >= 18;
//   });
// let filteredAdultUsers = adultUsers(users);

// console.log(filteredAdultUsers);

// const adultUsers = users.filter((user) => user.age > 18);
// console.log(adultUsers);
// =================================================================================================== \\

// 3.სტრიქონების გაფილტვრა სიგრძის მიხედვით: სტრიქონების მასივის გათვალისწინებით, გამოიყენეთ ფილტრი მასივის შესაქმნელად,
//  რომელიც შეიცავს მხოლოდ 5 სიმბოლოზე მეტ სტრიქონებს.
// const stringsArray = [
//   "David Copperfield",
//   "Harry potter",
//   "Leon",
//   "jansugh",
//   "Mia",
//   "Mshia",
// ];
// const filteredStringsArray = stringsArray.filter((str) => str.length > 5);
// console.log(filteredStringsArray);
// =================================================================================================== \\

// 4.გააორმაგეთ რიცხვები: მოცემული რიცხვების მასივისთვის, შექმენით ახალი მასივი, სადაც თითოეული რიცხვი გაორმაგდება.
// const doubledNumbersArray = numbersArray.map((value) => value * 2);
// console.log(doubledNumbersArray);
// =================================================================================================== \\

// 5.მომხმარებლის ობიექტების მასივის გათვალისწინებით, შექმენით მასივი,სადაც მხოლოდ მომხმარებლის სახელებს დააბრუნებს.
// const userNames = users.map((user) => user.firstName);
// console.log(userNames);
// =================================================================================================== \\

// 6.სტრიქონების მასივის გათვალისწინებით, შევქმნათ ახალი მასივი, სადაც თითოეული სტრიქონი გარდაიქმნება მაღალ რეგისტრში,
// ანუ დიდ ასოებად
// const upperCasedStrings = stringsArray.map((element) => element.toUpperCase());
// console.log(upperCasedStrings);
// =================================================================================================== \\

// 7.იპოვეთ რიცხვების მასივში ყველა რიცხვის ჯამი.ვიყენებთ მაღალი დონის ფუნქციებს.

// =================================================================================================== \\

// 8.გვაქვს მასივი,სადაც ყრია ადამიანის სახელები,ჩვენი მიზანია შევქმნათ ობიექტი,
//  რომელშიც მითითებული იქნება თუ რამდენჯერ მეორდება მასივში თითოეული სახელი.
// მაგალითად: { "გიო": 2, "საბა": 5, "ნიკა": 3 }
// =================================================================================================== \\

// 9.რიცხვების მასივის გათვალისწინებით,დავალაგოთ მასივი ზრდადობით.
// =================================================================================================== \\

// 10.რიცხვების მასივის გათვალისწინებით,დავალაგოთ მასივი კლებადობით.
// =================================================================================================== \\

// 11.მომხმარებლების დალაგება სახელების მიხედვით: მომხმარებლის ობიექტების მასივის გათვალისწინებით,
// დავაბრუნოთ მასივი რომელიც დალაგებული იქნება  ანბანურად მომხმარებლის სახელის მიხედვით.
// =================================================================================================== \\

// 12.სტრიქონების მასივის გათვალისწინებით, დავაბრუნოთ მასივი,რომელშიც იქნება ელემენტები
// ზრდადობით,სტრიქონების სიგრძის  მიხედვით.
// =================================================================================================== \\

// 13.მასივის გათვალისწინებით, გამოიყენეთ forEach თითოეული ელემენტის კონსოლში დასაპრინტად.
// =================================================================================================== \\

// 14.რიცხვების მასივის გათვალისწინებით, გამოიყენეთ forEach რიცხვების  ჯამის გამოსათვლელად.
// =================================================================================================== \\
