// 1.რიცხვების მასივის გათვალისწინებით, გამოიყენეთ ფილტრი ახალი მასივის შესაქმნელად,
//  რომელიც შეიცავს მხოლოდ ლუწი რიცხვებს.
const numbersArray = [23, 12, 34, 13, 56, 78, 79, 45];

// const evenNumbersArray = numbersArray.filter((el) => el % 2 === 0);
// console.log(evenNumbersArray);
// =================================================================================================== \\

// 2.მომხმარებლების გაფილტვრა ასაკის მიხედვით: მომხმარებლის ობიექტების მასივის გათვალისწინებით,
//  თვისებების სახელით და ასაკის მიხედვით, გამოიყენეთ ფილტრი 18 წელზე უფროსი ასაკის მომხმარებელთა მასივის შესაქმნელად.
const users = [
  { id: 1, age: 8, firstName: "kesane" },
  { id: 2, age: 14, firstName: "maya" },
  { id: 3, age: 14, firstName: "tatu" },
  { id: 4, age: 43, firstName: "me" },
];

// const adultUsers = users.filter((user) => user.age > 18);
// console.log(adultUsers);
// =================================================================================================== \\

// 3.სტრიქონების გაფილტვრა სიგრძის მიხედვით: სტრიქონების მასივის გათვალისწინებით, გამოიყენეთ ფილტრი მასივის შესაქმნელად,
//  რომელიც შეიცავს მხოლოდ 5 სიმბოლოზე მეტ სტრიქონებს.
const stringsArray = [
  "David Copperfield",
  "Harry potter",
  "Leon",
  "jansugh",
  "Mia",
  "Mshia",
];
// const filteredStringsArray = stringsArray.filter((str) => str.length > 5);
// console.log(filteredStringsArray);
// =================================================================================================== \\

// 4.გააორმაგეთ რიცხვები: მოცემული რიცხვების მასივისთვის, შექმენით ახალი მასივი, სადაც თითოეული რიცხვი გაორმაგდება.
// const doubledNumbersArray = numbersArray.map((value) => value * 2);
// console.log(doubledNumbersArray);
// =================================================================================================== \\

// 5.მომხმარებლის ობიექტების მასივის გათვალისწინებით, შექმენით მასივი,სადაც მხოლოდ მომხმარებლის სახელებს დააბრუნებს.
// const userNames = users.map((user) => user.firstName);
// console.log(userNames);
// =================================================================================================== \\

// 6.სტრიქონების მასივის გათვალისწინებით, შევქმნათ ახალი მასივი, სადაც თითოეული სტრიქონი გარდაიქმნება მაღალ რეგისტრში,
// ანუ დიდ ასოებად
// const upperCasedStrings = stringsArray.map((element) => element.toUpperCase());
// console.log(upperCasedStrings);
// =================================================================================================== \\
